In [1]:
import pandas as pd

In [2]:
# The data source is from Malaysia DOSM (https://data.gov.my/data-catalogue/births)
URL_DATA = 'https://storage.data.gov.my/demography/births.parquet'

# Extract data from source
df = pd.read_parquet(URL_DATA)

print(df.head())

         date     state  births
0  1920-01-01  Malaysia      96
1  1920-01-02  Malaysia     115
2  1920-01-03  Malaysia     111
3  1920-01-04  Malaysia     101
4  1920-01-05  Malaysia      95

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  object
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: int64(1), object(2)
memory usage: 886.8+ KB

In [4]:
# Task 1: Based on the lesson learned previously, convert the "DATE" column data type into datetime format
df['date'] = pd.to_datetime(df['date'], format='mixed' )
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  datetime64[ns]
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 886.8+ KB

In [5]:
# Task 2a: Extract the Month name (e.g. January/February/March etc) into another column called "MONTH_NAME"
# Then get average of births aggregate/group by MONTH_NAME
# The expected dataframe is something like this:

# |----------------|-----------|
# |MONTH_NAME      | AVG_BIRTH |
# |----------------|-----------|
# |JANUARY XXX     |           |
# |FEBRUARY XXX    |           |
# |MARCH XXX       |           |
#   .....           

...

Ellipsis

In [6]:
df['MONTH_NAME'] = df['date'].dt.month_name()

In [7]:
df_1 = df.groupby(['MONTH_NAME']).agg(
                        AVG_BIRTH = ('births', 'mean')
).reset_index()

In [8]:
df_1.head(5)

  MONTH_NAME   AVG_BIRTH
0      April  945.387500
1     August  951.493893
2   December  951.100846
3   February  904.976515
4    January  928.116935

In [9]:
# Task 2b: Save the aggregated dataframe in task 2a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_month.csv
# Example: azhar_avg_birth_by_month.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

...

Ellipsis

In [10]:
df_1.to_csv('syahmi_avg_birth_by_month.csv', index=False)

In [11]:
# Task 3a: Create a dataframe to calculate average birth by the following generation group:
# --> Silent Generation - from 1928 to 1945 included
# --> Baby Boomers - from 1946 to 1964 included
# --> Gen X - from 1965 to 1980 included
# --> Gen Y - from 1981 to 1996 included
# The expected dataframe is something like this:

# |----------------|-----------|
# |GENERATION      | AVG_BIRTH |
# |----------------|-----------|
# |Gen X           |           |
# |Gen Y           |           |
# ......

# Hint: Use for-loop and if/else

...

Ellipsis

In [12]:
df['year'] = df.date.dt.year

In [13]:
df.head()

        date     state  births MONTH_NAME  year
0 1920-01-01  Malaysia      96    January  1920
1 1920-01-02  Malaysia     115    January  1920
2 1920-01-03  Malaysia     111    January  1920
3 1920-01-04  Malaysia     101    January  1920
4 1920-01-05  Malaysia      95    January  1920

In [14]:
for i,x in enumerate(df['year']):
    if x<= 1945:
        df.loc[i, 'generation'] = 'Silent Generation'
    elif x<= 1964:
        df.loc[i, 'generation'] = 'Baby Boomers'
    elif x<= 1980:
        df.loc[i, 'generation'] = 'Gen X'
    elif x<=1996:
        df.loc[i, 'generation'] = 'Gen Y'

In [15]:
df_2 = df.groupby('generation')['births'].mean().reset_index()

In [16]:
df_2.head()

          generation       births
0       Baby Boomers   764.404899
1              Gen X  1057.826318
2              Gen Y  1417.433778
3  Silent Generation   265.749710

In [17]:
df.sample(10)

            date     state  births MONTH_NAME  year         generation
31828 2007-02-21  Malaysia    1471   February  2007                NaN
25006 1988-06-18  Malaysia    1329       June  1988              Gen Y
11494 1951-06-21  Malaysia     566       June  1951       Baby Boomers
17015 1966-08-02  Malaysia    1031     August  1966              Gen X
14006 1958-05-07  Malaysia     979        May  1958       Baby Boomers
31952 2007-06-25  Malaysia    1382       June  2007                NaN
8850  1944-03-25  Malaysia     388      March  1944  Silent Generation
11270 1950-11-09  Malaysia     548   November  1950       Baby Boomers
16800 1965-12-30  Malaysia     754   December  1965              Gen X
21520 1978-12-02  Malaysia    1057   December  1978              Gen X

In [18]:
# Task 3b: Save the aggregated dataframe in task 3a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_generation.csv
# Example: azhar_avg_birth_by_generation.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

...

Ellipsis

In [19]:
df_2.to_csv('syahmi_avg_birth_generation.csv', index=False)